# IsPainted Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..IsPainted Method
Document Class See Also
---
Checks if the element's face is painted with a material.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsPainted(
	ElementId elementId,
	Face face
)
```

Visual Basic
---
```text
Public Function IsPainted ( _
	elementId As ElementId, _
	face As Face _
) As Boolean
```

Visual C++
---
```text
public:
bool IsPainted(
	ElementId^ elementId,
	Face^ face
)
```

# ### Parameters
elementId
    Type: Autodesk.Revit.DB..::..ElementId The element that the face belongs to.
face
    Type: Autodesk.Revit.DB..::..Face The painted element's face.
# ### Return Value
True if the element's face is painted.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The element elementId does not exist in the document -or- The face doesn't belong to the element |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Document Class
Autodesk.Revit.DB Namespace